Tekla.Structures.Dialog.ApplicationFormBase
The ApplicationFormBase class is the base class for all Tekla Structures dialogs.
The class provides localization, unit conversion and data storage
(temporary and file-based) among other things.

Tekla.Structures.Dialog.ApplicationFormBase.#ctor
The default constructor that does not need parameters.
Initializes the form and registers property bindings.

Tekla.Structures.Dialog.ApplicationFormBase.DoLoad
It raises the Load event.

Tekla.Structures.Dialog.ApplicationFormBase.DoInitializeForm
Prepares the data storage for the dialog and scans through the fields.

Tekla.Structures.Dialog.ApplicationFormBase.Apply
The method to call when the Apply button is clicked. Stores the current dialog
values to the dialog data storage.